Revit 2027 API
BuiltInFailures.PerformanceFailures.ClippingIsDisabled Property
 View has clipping disabled. It causes view to draw too many elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClippingIsDisabled { get; }
Public Shared ReadOnly Property ClippingIsDisabled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClippingIsDisabled {
	FailureDefinitionId^ get ();
}
static member ClippingIsDisabled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace